public/personal/bible_studies.html
<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <title>Exegesis</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <meta name="description" content="">
  <meta name="keywords" content="">
  <link rel="stylesheet" href="/assets/css/main.css">
  <link rel="stylesheet" href="/assets/css/modus-operandi.css" id="noty-theme">
</head>
<body>
  <header class="noty-header">
    <nav class="noty-nav">
  <a href="/index.html" class="noty-nav-brand">Home</a>
  <ul class="noty-nav-list">
    <li><a href="/areas/index.html">Areas</a></li>
    <li><a href="/projects/index.html">Projects</a></li>
    <li><a href="/personal/index.html">Personal</a></li>
    <li><a href="/pages/manual.html">Manual</a></li>
  </ul>
  <div class="noty-nav-actions">
    <button class="theme-toggle" type="button" title="Toggle theme">🌓</button>
    <button class="sidenote-toggle" type="button" title="Toggle notes">☰</button>
  </div>
</nav>

  </header>
  <main class="page">
    <aside class="left-bar">
      <div id="toc"></div>
    </aside>
    <article class="content noty-article">
      <h1 class="noty-title">Exegesis</h1>
      <div id="outline-container-orgc5ba5d3" class="outline-2">
<h2 id="orgc5ba5d3"><span class="section-number-2">1.</span> Veneration of Mary</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org71c1bf4" class="outline-3">
<h3 id="org71c1bf4"><span class="section-number-3">1.1.</span> Luke 23:40-43</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Of course this story of the theif is about us being accepted for as long as we confess Christ as our Lord. I am not using this verse in order to discuss Sola Fide, but pureley as a demonstrative of the location of theif once he passes. Jesus says 'today you will be in heaven with me'. 
</p>


<p>
However there are counter points. While salvation is ultimately 
</p>


<p>
I was using it with not as point of theology
</p>


<p>
but instead as statement regarding where the repented theif is
</p>
</div>
</div>
</div>

      
    </article>
    <!-- notes-panel is created dynamically if missing -->
  </main>
  <footer class="noty-footer">
    <div class="noty-footer-inner">
  <p>Generated with <code>emacs-noty</code>.</p>
</div>

  </footer>
  <script src="/assets/js/theme.js"></script>
  <script src="/assets/js/site.js"></script>
  <script src="/assets/js/refs.js"></script>
  <script src="/assets/js/scroll-restore.js"></script>
  <script src="/assets/js/load-math-macros.js"></script>
  <script src="/assets/js/link-preview.js"></script>
  <script src="/assets/js/mathjax-config.js"></script>
<script src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-svg.js" id="MathJax-script"></script>

</body>
</html>
